# EnableIgnoredCategoryIds Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RouteAnalysisSettings..::..EnableIgnoredCategoryIds Property
RouteAnalysisSettings Class See Also
---
When this setting is true, elements with category ids returned by GetIgnoredCategoryIds will be ignored in route calculation. default is true as all elements with the Door Category Id are ignored by default.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public bool EnableIgnoredCategoryIds { get; set; }
```

Visual Basic
---
```text
Public Property EnableIgnoredCategoryIds As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool EnableIgnoredCategoryIds {
	bool get ();
	void set (bool value);
}
```

# See Also
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace